## **Exercise 8:** Maximum Value in a numerical column

#### **The Problem:**

Print the highest value in the fare column.

#### **The Solution:**

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('titanic.csv')

In [3]:
print(df['fare'].max())

512.3292

## **Exercise 9:** Most common Value in a numerical column

#### **The Problem:**

What is the most common/frequent ticket price (fare)?
Print the price!

#### **The Solution:**

In [4]:
import pandas as pd

In [5]:
df = pd.read_csv('titanic.csv')

In [6]:
serie = df['fare'].value_counts()

In [7]:
print(serie.index[0])

8.05

## **Coding Exercise 10:** Unique Values in a Text Column

#### **The Problem:**

How many (unique) Athletes won at least one Medal in the 1972 Edition?
Print the number of unique Athletes.

#### **The Solution:**

In [8]:
import pandas as pd

In [9]:
df = pd.read_csv('summer.csv')

In [10]:
df.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

In [11]:
df_1972 = df[df['Year'] == 1972]

In [12]:
print(df_1972.Athlete.nunique())

1053

## **Coding Exercise 11:** Most common value in a text column

#### **The Problem:**

Which was the most successful (most medals) Athlete in the 1972 Edition?

Print the Athlete!

#### **The Solution:**

In [13]:
import pandas as pd

In [14]:
df = pd.read_csv('summer.csv')

In [16]:
df_1972 = df[df['Year'] == 1972]

In [31]:
athletes_1972 = df_1972['Athlete']
athletes_1972_counts = athletes_1972.value_counts()
answer = athletes_1972_counts.index[0]
print(answer)

SPITZ, Mark

## **Coding Exercise 12:** Creating Pandas Series from scratch

#### **The Problem:**

Create a Pandas Series with the Countries "Spain" and "France" in the Index and their Capitals "Madrid" and "Paris" as Values. Save the Pandas Series in the variable series (you may print series as well).

Use the same sequence as instructed above ("Spain", "France")!

#### **The Solution:**

In [2]:
import pandas as pd

values = {
    "Spain": "Madrid",
    "France": "Paris"
}

series = pd.Series(values)
print(series)

Spain     Madrid
France     Paris
dtype: object

## **Coding Exercise 13:** Sorting "inplace"

#### **The Problem:**

Sort the Pandas Series fare from high to low "inplace" (you may finally print fare)!

#### **The Solution:**

In [3]:
import pandas as pd

df = pd.read_csv("titanic.csv")
fare = df.fare.copy()
fare.sort_values(ascending = False, inplace = True)
print(fare)

258    512.3292
737    512.3292
679    512.3292
88     263.0000
27     263.0000
         ...
633      0.0000
413      0.0000
822      0.0000
732      0.0000
674      0.0000
Name: fare, Length: 891, dtype: float64

## **Coding Exercise 14:** The n largest values in a Pandas Series

#### **The Problem:**

Save a Pandas Series with the 10 largest ticket prices in the variable expensive (you may print expensive as well).

#### **The Solution:**

In [4]:
import pandas as pd

df = pd.read_csv("titanic.csv")
fare = df.fare
expensive = fare.nlargest(n = 10)
print(expensive)

258    512.3292
679    512.3292
737    512.3292
27     263.0000
88     263.0000
341    263.0000
438    263.0000
311    262.3750
742    262.3750
118    247.5208
Name: fare, dtype: float64